Revit 2026 API

# EnergyDataSettingsProjectReportType Property

---

Report type: None, simple, standard, detailed

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public HVACLoadLoadsReportType ProjectReportType { get; set; }
```
```vb
Public Property ProjectReportType As HVACLoadLoadsReportType
	Get
	Set
```
```cpp
public:
property HVACLoadLoadsReportType ProjectReportType {
	HVACLoadLoadsReportType get ();
	void set (HVACLoadLoadsReportType value);
}
```
```fsharp
member ProjectReportType : HVACLoadLoadsReportType with get, set
```

#### Property Value

HVACLoadLoadsReportType

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The project report type does not fall within an appropriate range. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace